Revit 2026 API

# RebarBendingDetailSetTagRelativeRotation Method

---

Sets the embedded tag rotation angle w.r.t. the realistic bending detail element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SetTagRelativeRotation(
	Element bendingDetail,
	double rotation
)
```
```vb
Public Shared Sub SetTagRelativeRotation (
	bendingDetail As Element,
	rotation As Double
)
```
```cpp
public:
static void SetTagRelativeRotation(
	Element^ bendingDetail,
	double rotation
)
```
```fsharp
static member SetTagRelativeRotation :
        bendingDetail : Element *
        rotation : float -> unit
```

#### Parameters

bendingDetail Element
     The bending detail element.
rotation Double
     The new rotation angle of the embedded tag w.r.t. the bending detail element.

| Exception | Condition |
| --- | --- |
| ArgumentException | This option is only available for realistic bending detail elements. -or- The given value for rotation is not a number -or- The given value for rotation is not finite |
| ArgumentNullException | A non-optional argument was null |

This function is exclusive to realistic bending detail mode.

#### Reference

RebarBendingDetail Class

Autodesk.Revit.DB.Structure Namespace